###################################################################

# Created by write_sdc on Wed Dec 19 17:01:31 2018

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
set_wire_load_mode top
set_wire_load_model -name 1K -library 14nm_sg_345K_maxfan4_wire
set_max_leakage_power 0
create_clock [get_ports clk]  -period 1429  -waveform {0 714.5}
set_clock_uncertainty 50  [get_clocks clk]
set_max_delay 1429  -to [get_ports idle]
set_max_delay 1429  -to [get_ports {INT[0]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[31]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[30]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[29]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[28]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[27]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[26]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[25]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[24]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[23]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[22]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[21]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[20]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[19]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[18]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[17]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[16]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[15]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[14]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[13]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[12]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[11]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[10]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[9]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[8]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[7]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[6]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[5]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[4]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[3]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[2]}]
set_max_delay 1429  -to [get_ports {periph_tx_clr[1]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[31]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[30]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[29]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[28]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[27]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[26]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[25]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[24]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[23]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[22]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[21]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[20]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[19]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[18]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[17]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[16]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[15]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[14]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[13]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[12]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[11]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[10]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[9]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[8]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[7]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[6]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[5]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[4]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[3]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[2]}]
set_max_delay 1429  -to [get_ports {periph_rx_clr[1]}]
set_max_delay 1429  -to [get_ports {prdata[31]}]
set_max_delay 1429  -to [get_ports {prdata[30]}]
set_max_delay 1429  -to [get_ports {prdata[29]}]
set_max_delay 1429  -to [get_ports {prdata[28]}]
set_max_delay 1429  -to [get_ports {prdata[27]}]
set_max_delay 1429  -to [get_ports {prdata[26]}]
set_max_delay 1429  -to [get_ports {prdata[25]}]
set_max_delay 1429  -to [get_ports {prdata[24]}]
set_max_delay 1429  -to [get_ports {prdata[23]}]
set_max_delay 1429  -to [get_ports {prdata[22]}]
set_max_delay 1429  -to [get_ports {prdata[21]}]
set_max_delay 1429  -to [get_ports {prdata[20]}]
set_max_delay 1429  -to [get_ports {prdata[19]}]
set_max_delay 1429  -to [get_ports {prdata[18]}]
set_max_delay 1429  -to [get_ports {prdata[17]}]
set_max_delay 1429  -to [get_ports {prdata[16]}]
set_max_delay 1429  -to [get_ports {prdata[15]}]
set_max_delay 1429  -to [get_ports {prdata[14]}]
set_max_delay 1429  -to [get_ports {prdata[13]}]
set_max_delay 1429  -to [get_ports {prdata[12]}]
set_max_delay 1429  -to [get_ports {prdata[11]}]
set_max_delay 1429  -to [get_ports {prdata[10]}]
set_max_delay 1429  -to [get_ports {prdata[9]}]
set_max_delay 1429  -to [get_ports {prdata[8]}]
set_max_delay 1429  -to [get_ports {prdata[7]}]
set_max_delay 1429  -to [get_ports {prdata[6]}]
set_max_delay 1429  -to [get_ports {prdata[5]}]
set_max_delay 1429  -to [get_ports {prdata[4]}]
set_max_delay 1429  -to [get_ports {prdata[3]}]
set_max_delay 1429  -to [get_ports {prdata[2]}]
set_max_delay 1429  -to [get_ports {prdata[1]}]
set_max_delay 1429  -to [get_ports {prdata[0]}]
set_max_delay 1429  -to [get_ports pslverr]
set_max_delay 1429  -to [get_ports pready]
set_max_delay 1429  -to [get_ports {AWID0[0]}]
set_max_delay 1429  -to [get_ports {AWADDR0[31]}]
set_max_delay 1429  -to [get_ports {AWADDR0[30]}]
set_max_delay 1429  -to [get_ports {AWADDR0[29]}]
set_max_delay 1429  -to [get_ports {AWADDR0[28]}]
set_max_delay 1429  -to [get_ports {AWADDR0[27]}]
set_max_delay 1429  -to [get_ports {AWADDR0[26]}]
set_max_delay 1429  -to [get_ports {AWADDR0[25]}]
set_max_delay 1429  -to [get_ports {AWADDR0[24]}]
set_max_delay 1429  -to [get_ports {AWADDR0[23]}]
set_max_delay 1429  -to [get_ports {AWADDR0[22]}]
set_max_delay 1429  -to [get_ports {AWADDR0[21]}]
set_max_delay 1429  -to [get_ports {AWADDR0[20]}]
set_max_delay 1429  -to [get_ports {AWADDR0[19]}]
set_max_delay 1429  -to [get_ports {AWADDR0[18]}]
set_max_delay 1429  -to [get_ports {AWADDR0[17]}]
set_max_delay 1429  -to [get_ports {AWADDR0[16]}]
set_max_delay 1429  -to [get_ports {AWADDR0[15]}]
set_max_delay 1429  -to [get_ports {AWADDR0[14]}]
set_max_delay 1429  -to [get_ports {AWADDR0[13]}]
set_max_delay 1429  -to [get_ports {AWADDR0[12]}]
set_max_delay 1429  -to [get_ports {AWADDR0[11]}]
set_max_delay 1429  -to [get_ports {AWADDR0[10]}]
set_max_delay 1429  -to [get_ports {AWADDR0[9]}]
set_max_delay 1429  -to [get_ports {AWADDR0[8]}]
set_max_delay 1429  -to [get_ports {AWADDR0[7]}]
set_max_delay 1429  -to [get_ports {AWADDR0[6]}]
set_max_delay 1429  -to [get_ports {AWADDR0[5]}]
set_max_delay 1429  -to [get_ports {AWADDR0[4]}]
set_max_delay 1429  -to [get_ports {AWADDR0[3]}]
set_max_delay 1429  -to [get_ports {AWADDR0[2]}]
set_max_delay 1429  -to [get_ports {AWADDR0[1]}]
set_max_delay 1429  -to [get_ports {AWADDR0[0]}]
set_max_delay 1429  -to [get_ports {AWLEN0[3]}]
set_max_delay 1429  -to [get_ports {AWLEN0[2]}]
set_max_delay 1429  -to [get_ports {AWLEN0[1]}]
set_max_delay 1429  -to [get_ports {AWLEN0[0]}]
set_max_delay 1429  -to [get_ports {AWSIZE0[1]}]
set_max_delay 1429  -to [get_ports {AWSIZE0[0]}]
set_max_delay 1429  -to [get_ports AWVALID0]
set_max_delay 1429  -to [get_ports {WID0[0]}]
set_max_delay 1429  -to [get_ports {WDATA0[63]}]
set_max_delay 1429  -to [get_ports {WDATA0[62]}]
set_max_delay 1429  -to [get_ports {WDATA0[61]}]
set_max_delay 1429  -to [get_ports {WDATA0[60]}]
set_max_delay 1429  -to [get_ports {WDATA0[59]}]
set_max_delay 1429  -to [get_ports {WDATA0[58]}]
set_max_delay 1429  -to [get_ports {WDATA0[57]}]
set_max_delay 1429  -to [get_ports {WDATA0[56]}]
set_max_delay 1429  -to [get_ports {WDATA0[55]}]
set_max_delay 1429  -to [get_ports {WDATA0[54]}]
set_max_delay 1429  -to [get_ports {WDATA0[53]}]
set_max_delay 1429  -to [get_ports {WDATA0[52]}]
set_max_delay 1429  -to [get_ports {WDATA0[51]}]
set_max_delay 1429  -to [get_ports {WDATA0[50]}]
set_max_delay 1429  -to [get_ports {WDATA0[49]}]
set_max_delay 1429  -to [get_ports {WDATA0[48]}]
set_max_delay 1429  -to [get_ports {WDATA0[47]}]
set_max_delay 1429  -to [get_ports {WDATA0[46]}]
set_max_delay 1429  -to [get_ports {WDATA0[45]}]
set_max_delay 1429  -to [get_ports {WDATA0[44]}]
set_max_delay 1429  -to [get_ports {WDATA0[43]}]
set_max_delay 1429  -to [get_ports {WDATA0[42]}]
set_max_delay 1429  -to [get_ports {WDATA0[41]}]
set_max_delay 1429  -to [get_ports {WDATA0[40]}]
set_max_delay 1429  -to [get_ports {WDATA0[39]}]
set_max_delay 1429  -to [get_ports {WDATA0[38]}]
set_max_delay 1429  -to [get_ports {WDATA0[37]}]
set_max_delay 1429  -to [get_ports {WDATA0[36]}]
set_max_delay 1429  -to [get_ports {WDATA0[35]}]
set_max_delay 1429  -to [get_ports {WDATA0[34]}]
set_max_delay 1429  -to [get_ports {WDATA0[33]}]
set_max_delay 1429  -to [get_ports {WDATA0[32]}]
set_max_delay 1429  -to [get_ports {WDATA0[31]}]
set_max_delay 1429  -to [get_ports {WDATA0[30]}]
set_max_delay 1429  -to [get_ports {WDATA0[29]}]
set_max_delay 1429  -to [get_ports {WDATA0[28]}]
set_max_delay 1429  -to [get_ports {WDATA0[27]}]
set_max_delay 1429  -to [get_ports {WDATA0[26]}]
set_max_delay 1429  -to [get_ports {WDATA0[25]}]
set_max_delay 1429  -to [get_ports {WDATA0[24]}]
set_max_delay 1429  -to [get_ports {WDATA0[23]}]
set_max_delay 1429  -to [get_ports {WDATA0[22]}]
set_max_delay 1429  -to [get_ports {WDATA0[21]}]
set_max_delay 1429  -to [get_ports {WDATA0[20]}]
set_max_delay 1429  -to [get_ports {WDATA0[19]}]
set_max_delay 1429  -to [get_ports {WDATA0[18]}]
set_max_delay 1429  -to [get_ports {WDATA0[17]}]
set_max_delay 1429  -to [get_ports {WDATA0[16]}]
set_max_delay 1429  -to [get_ports {WDATA0[15]}]
set_max_delay 1429  -to [get_ports {WDATA0[14]}]
set_max_delay 1429  -to [get_ports {WDATA0[13]}]
set_max_delay 1429  -to [get_ports {WDATA0[12]}]
set_max_delay 1429  -to [get_ports {WDATA0[11]}]
set_max_delay 1429  -to [get_ports {WDATA0[10]}]
set_max_delay 1429  -to [get_ports {WDATA0[9]}]
set_max_delay 1429  -to [get_ports {WDATA0[8]}]
set_max_delay 1429  -to [get_ports {WDATA0[7]}]
set_max_delay 1429  -to [get_ports {WDATA0[6]}]
set_max_delay 1429  -to [get_ports {WDATA0[5]}]
set_max_delay 1429  -to [get_ports {WDATA0[4]}]
set_max_delay 1429  -to [get_ports {WDATA0[3]}]
set_max_delay 1429  -to [get_ports {WDATA0[2]}]
set_max_delay 1429  -to [get_ports {WDATA0[1]}]
set_max_delay 1429  -to [get_ports {WDATA0[0]}]
set_max_delay 1429  -to [get_ports {WSTRB0[7]}]
set_max_delay 1429  -to [get_ports {WSTRB0[6]}]
set_max_delay 1429  -to [get_ports {WSTRB0[5]}]
set_max_delay 1429  -to [get_ports {WSTRB0[4]}]
set_max_delay 1429  -to [get_ports {WSTRB0[3]}]
set_max_delay 1429  -to [get_ports {WSTRB0[2]}]
set_max_delay 1429  -to [get_ports {WSTRB0[1]}]
set_max_delay 1429  -to [get_ports {WSTRB0[0]}]
set_max_delay 1429  -to [get_ports WLAST0]
set_max_delay 1429  -to [get_ports WVALID0]
set_max_delay 1429  -to [get_ports BREADY0]
set_max_delay 1429  -to [get_ports {ARID0[0]}]
set_max_delay 1429  -to [get_ports {ARADDR0[31]}]
set_max_delay 1429  -to [get_ports {ARADDR0[30]}]
set_max_delay 1429  -to [get_ports {ARADDR0[29]}]
set_max_delay 1429  -to [get_ports {ARADDR0[28]}]
set_max_delay 1429  -to [get_ports {ARADDR0[27]}]
set_max_delay 1429  -to [get_ports {ARADDR0[26]}]
set_max_delay 1429  -to [get_ports {ARADDR0[25]}]
set_max_delay 1429  -to [get_ports {ARADDR0[24]}]
set_max_delay 1429  -to [get_ports {ARADDR0[23]}]
set_max_delay 1429  -to [get_ports {ARADDR0[22]}]
set_max_delay 1429  -to [get_ports {ARADDR0[21]}]
set_max_delay 1429  -to [get_ports {ARADDR0[20]}]
set_max_delay 1429  -to [get_ports {ARADDR0[19]}]
set_max_delay 1429  -to [get_ports {ARADDR0[18]}]
set_max_delay 1429  -to [get_ports {ARADDR0[17]}]
set_max_delay 1429  -to [get_ports {ARADDR0[16]}]
set_max_delay 1429  -to [get_ports {ARADDR0[15]}]
set_max_delay 1429  -to [get_ports {ARADDR0[14]}]
set_max_delay 1429  -to [get_ports {ARADDR0[13]}]
set_max_delay 1429  -to [get_ports {ARADDR0[12]}]
set_max_delay 1429  -to [get_ports {ARADDR0[11]}]
set_max_delay 1429  -to [get_ports {ARADDR0[10]}]
set_max_delay 1429  -to [get_ports {ARADDR0[9]}]
set_max_delay 1429  -to [get_ports {ARADDR0[8]}]
set_max_delay 1429  -to [get_ports {ARADDR0[7]}]
set_max_delay 1429  -to [get_ports {ARADDR0[6]}]
set_max_delay 1429  -to [get_ports {ARADDR0[5]}]
set_max_delay 1429  -to [get_ports {ARADDR0[4]}]
set_max_delay 1429  -to [get_ports {ARADDR0[3]}]
set_max_delay 1429  -to [get_ports {ARADDR0[2]}]
set_max_delay 1429  -to [get_ports {ARADDR0[1]}]
set_max_delay 1429  -to [get_ports {ARADDR0[0]}]
set_max_delay 1429  -to [get_ports {ARLEN0[3]}]
set_max_delay 1429  -to [get_ports {ARLEN0[2]}]
set_max_delay 1429  -to [get_ports {ARLEN0[1]}]
set_max_delay 1429  -to [get_ports {ARLEN0[0]}]
set_max_delay 1429  -to [get_ports {ARSIZE0[1]}]
set_max_delay 1429  -to [get_ports {ARSIZE0[0]}]
set_max_delay 1429  -to [get_ports ARVALID0]
set_max_delay 1429  -to [get_ports RREADY0]
